---
type: DocumentSavingAsEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DocumentSavingAsEventArgs

`Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsSavingAsCentralFile | 2021.1 | `public bool IsSavingAsCentralFile { get ; }` |
| Property | PathName | 2010 | `public string PathName { get ; }` |